# Тема урока: цикл for
## [Python is awesome](https://stepik.org/lesson/265118/step/2?unit=246067)

Напишите программу, которая выводит слова «Python is awesome!» (без кавычек) 10 раз.

**Формат входных данных**

**Формат выходных данных**  
Программа должна вывести 10 раз текст «Python is awesome!», каждый на отдельной строке.

```python
for i in range(0, 10):
    print("Python is awesome!")
```

## [Повторяй за мной 1](https://stepik.org/lesson/265118/step/3?unit=246067)

Дано предложение и количество раз которое его надо повторить. Напишите программу, которая повторяет данное предложение нужное количество раз.

**Формат входных данных**  
В первой строке записано текстовое предложение, во второй — количество повторений.

**Формат выходных данных**  
Программа должна вывести указанное текстовое предложение нужное количество раз. Каждое повторение должно начинаться с новой строки.

```python
str, num = input(), int(input())
for i in range(0, num):
    print(str)
```

## [Последовательность символов](https://stepik.org/lesson/265118/step/4?unit=246067)

Напишите программу, которая использует **ровно три цикла for** для печати следующей последовательности символов:

```no-highlight
AAA
AAA
AAA
AAA
AAA
AAA
BBBB
BBBB
BBBB
BBBB
BBBB
E
TTTTT
TTTTT
TTTTT
TTTTT
TTTTT
TTTTT
TTTTT
TTTTT
TTTTT
G
```


```python
for i in range(0, 6):
    print("A" * 3)
for i in range(0, 5):
    print("B" * 4)
print("E")
for i in range(0, 9):
    print("T" * 5)
print("G")
```

## [Звездный прямоугольник](https://stepik.org/lesson/265118/step/5?unit=246067)

На вход программе подается натуральное число nn.

Напишите программу, которая печатает звездный прямоугольник размерами n×19.

**Формат входных данных**  
На вход программе подаётся натуральное число n n∈[1;20] — высота звездного прямоугольника.

**Формат выходных данных**  
Программа должна вывести звездный прямоугольник размерами n×19.

**Подсказка.** Для печати звездной линии используйте умножение строки на число.

```python
n = int(input())

for i in range(0, n):
    print("*" * 19)
```

## **Повторяй за мной 2**

Напишите программу, которая считывает одну строку текста и выводит 10 строк, пронумерованных от 0 до 9, каждая с указанной строкой текста.

**Формат входных данных**  
На вход программе подается одна строка текста.

**Формат выходных данных**  
Программа должна вывести десять строк в соответствии с условием задачи.

```python
str = input()
for i in range(0, 10):
    print(i, str)
```

## [Квадрат числа](https://stepik.org/lesson/265118/step/8?unit=246067)

На вход программе подается натуральное число n. Напишите программу, которая для каждого из чисел от 0 до n (включительно) выводит фразу: «Квадрат числа [число] равен [число]» (без кавычек).

**Формат входных данных**  
На вход программе подается натуральное число nn.

**Формат выходных данных**  
Программа должна вывести текст в соответствии с условием задачи.

```python
n = int(input())
for i in range(0, n + 1):
    print("Квадрат числа", i, "равен", i ** 2)
```

## [Звездный треугольник](https://stepik.org/lesson/265118/step/9?unit=246067)

На вход программе подается натуральное число n (n≥2) – катет прямоугольного равнобедренного треугольника.

Напишите программу, которая выводит звездный треугольник в соответствии с примером.

```
***
**
*
```

**Формат выходных данных**  
Программа должна вывести треугольник в соответствии с условием задачи.

```python
n = int(input())
for i in range(0, n + 1):
    print("*" * (n - i))
```


## [Популяция](https://stepik.org/lesson/265118/step/10?unit=246067)

На вход программе подается три натуральных числа m,p,n:

-   m: стартовое количество организмов;
-   p: среднесуточное увеличение в %;
-   n: количество дней для размножения.

Напишите программу, которая предсказывает размер популяции организмов. Программа должна выводить размер популяции в каждый день, начиная с 11 и заканчивая nn-м днем.

**Формат входных данных**  
На вход программе подается три натуральных числа.

**Формат выходных данных**  
Программа должна вывести текст в соответствии с условием задачи.

```python
m, p, n = int(input()), int(input()), int(input())
for i in range(0, n):
    print(i + 1, m)
    m = m + (p / 100) * m
```

