# Цикл for: функция range

## [Последовательность чисел 1](https://stepik.org/lesson/265120/step/7?unit=246069)

Даны два целых числа m и n (m≤n). Напишите программу, которая выводит все числа от m до n включительно.

**Формат входных данных**  
На вход программе подаются два целых числа mm и nn, каждое на отдельной строке.

**Формат выходных данных**  
Программа должна вывести числа в соответствии с условием задачи.

```python
m, n = int(input()), int(input())
for i in range(m, n + 1):
    print(i)
```

## [Последовательность чисел 2 🌶️](https://stepik.org/lesson/265120/step/8?unit=246069)

Даны два целых числа mm и nn. Напишите программу, которая выводит все числа от m до n включительно в порядке возрастания, если m < n, или в порядке убывания в противном случае.

**Формат входных данных**  
На вход программе подаются два целых числа mm и nn, каждое на отдельной строке.

**Формат выходных данных**  
Программа должна вывести числа в соответствии с условием задачи.

```python
m, n = int(input()), int(input())

if (m < n):
    start = m
    end = n + 1
    step = 1
else:
    start = m
    end = n - 1
    step = -1

for i in range(start, end, step):
    print(i)
```

## [Последовательность чисел 3 🌶️](https://stepik.org/lesson/265120/step/9?unit=246069)

Даны два целых числа mm и nn (m > nm>n). Напишите программу, которая выводит все нечетные числа от m до n включительно в порядке убывания.

**Формат входных данных**  
На вход программе подаются два целых числа mm и nn, каждое на отдельной строке.

**Формат выходных данных**  
Программа должна вывести числа в соответствии с условием задачи.

```python
m, n = int(input()), int(input())
if (m % 2 == 0):
    m = m - 1
for i in range(m, n - 1, -2):
    print(i)
```

## [Последовательность чисел 4](https://stepik.org/lesson/265120/step/10?unit=246069)

Даны два натуральных числа m и n (m≤n). Напишите программу, которая выводит все числа от m до n включительно удовлетворяющие **хотя бы одному** из условий:

-   число кратно 17;
-   число оканчивается на 9;
-   число кратно 3 и 5 одновременно.

**Формат входных данных**  
На вход программе подаются два натуральных числа m и n (m≤n), каждое на отдельной строке.

**Формат выходных данных**  
Программа должна вывести числа в соответствии с условием задачи.

**Примечание.** Если чисел удовлетворяющих условию нет, выводить ничего не надо.

```python
m, n = int(input()), int(input())
for i in range(m, n + 1):
    if i % 17 == 0 or i % 10 == 9 or (i % 3 == 0 and i % 5 == 0):
        print(i)
```

## [Таблица умножения](https://stepik.org/lesson/265120/step/11?unit=246069)

Дано натуральное число nn. Напишите программу, которая выводит таблицу умножения на nn.

**Формат входных данных**  
На вход программе подается натуральное число.

**Формат выходных данных**  
Программа должна вывести таблицу умножения на введенное число.

**Примечание.** В качестве знака умножения используйте английскую букву x.

```python
n = int(input())
for i in range(1, 11):
    print(n, "x", i, "=", n * i)
```

