# Тема урока: частые сценарии
## Количество чисел

На вход программе подаются два целых числа a и b (a≤b). Напишите программу, которая подсчитывает количество чисел в диапазоне от a до b включительно, куб которых оканчивается на 4 или 9.

**Формат входных данных**  
На вход программе подаются два целых числа a и b.

**Формат выходных данных**  
Программа должна вывести одно целое число в соответствии с условием программы.

**Примечание.** Куб числа a – это его третья степень a^3.

```python
from math import pow
a, b = int(input()), int(input())
counter = 0
for i in range(a, b + 1):
    last_cube_num = pow(i, 3) % 10
    if last_cube_num == 4 or last_cube_num == 9:
        counter += 1
print(counter)
```

## Сумма чисел

На вход программе подается натуральное число n, а затем n целых чисел, каждое на отдельной строке. Напишите программу, которая подсчитывает сумму введенных чисел. 

**Формат входных данных**  
На вход программе подаются натуральное число n, а затем n целых чисел, каждое на отдельной строке.

**Формат выходных данных**  
Программа должна вывести сумму данных чисел.

```python
n = int(input())
sum = 0
for i in range(0, n):
    sum += int(input())
print(sum)
```

## [Асимптотическое приближение](https://stepik.org/lesson/294243/step/7?unit=275922)
```python
from math import log
n = int(input())
sum = 0
for i in range(1, n + 1):
    sum += 1 / i
print(sum - log(n))
```

## [Сумма чисел](https://stepik.org/lesson/294243/step/8?unit=275922)

На вход программе подается натуральное число nn. Напишите программу, которая подсчитывает сумму тех чисел от 1 до n (включительно) квадрат которых оканчивается на 2, 5 или 8.

**Формат входных данных**  
На вход программе подается натуральное число nn.

**Формат выходных данных**  
Программа должна вывести единственное число в соответствии с условием задачи.

**Примечание.** Если таких чисел нет в указанном диапазоне, то следует вывести 0.

```python
n = int(input())
sum = 0
for i in range(1, n + 1):
    mod = i ** 2 % 10
    if (mod == 2 or mod == 5 or mod == 8):
        sum += i
print(sum)
```

**Примечание** Натуральных чисел, квадраты которых оканчивались бы на 2 или 8, не существует.

## [Факториал](https://stepik.org/lesson/294243/step/9?unit=275922)

На вход программе подается натуральное число nn. Напишите программу, которая вычисляет n!.

```python
n = int(input())
result = 1
for i in range(1, n + 1):
    result *= i
print(result)
```

## [Без нулей](https://stepik.org/lesson/294243/step/10?unit=275922)

Напишите программу, которая считывает 10 чисел и выводит произведение отличных от нуля чисел.

**Формат входных данных**  
На вход программе подаются 10 целых чисел, каждое на отдельной строке.

**Формат выходных данных**  
Программа должна вывести произведение отличных от нуля чисел.

**Примечание.** Гарантируется, что хотя бы одно из 10 чисел является ненулевым.

```python
result = 1
for i in range(10):
    num = int(input())
    if (num != 0):
        result *= num
print(result)
```

## [Сумма делителей](https://stepik.org/lesson/294243/step/11?unit=275922)

На вход программе подается натуральное число n. Напишите программу, которая вычисляет сумму всех его делителей.

**Входные данные**  
На вход программе подается натуральное число n.

**Выходные данные**  
Программа должна вывести единственное число в соответствии с условием задачи.

**Примечание.** Функция подсчета суммы всех делителей числа является очень важной в теории чисел.
```python
n = int(input())
result = 0
for i in range(1, n + 1):
    if (n % i == 0):
        result += i
print(result)
```

## [Знакочередующаяся сумма](https://stepik.org/lesson/294243/step/12?unit=275922)
```python
n = int(input())
result = 0
for i in range(1, n + 1):
    result += (-1) ** (i + 1) * i
print(result)
```

## [Наибольшие числа 🌶️🌶️](https://stepik.org/lesson/294243/step/13?unit=275922)

На вход программе подается натуральное число n, а затем n различных натуральных чисел, каждое на отдельной строке. Напишите программу, которая выводит наибольшее и второе наибольшее число последовательности.

**Формат входных данных**  
На вход программе подаются натуральное число n n≥2, а затем n различных натуральных чисел, каждое на отдельной строке.

**Формат выходных данных**  
Программа должна вывести два наибольших числа, каждое на отдельной строке.

```python
n = int(input())
largest = 0
prev_largest = 0
for i in range(n):
    num = int(input())
    if (num > largest):
        prev_largest = largest
        largest = num
    elif (num > prev_largest):
        prev_largest = num
print(largest, prev_largest, sep="\n")
```

## Only even numbers 🌶️

Напишите программу, которая считывает последовательность из 10 целых чисел и определяет является ли каждое из них четным или нет.

**Формат входных данных**  
На вход программе подаются 10 целых чисел, каждое на отдельной строке.

**Формат выходных данных**  
Программа должна вывести строку «YES», если все числа четные и «NO» в ином случае

```python
is_even = True
for i in range(10):
    num = int(input())
    if (num % 2 == 1):
        is_even = False
if (is_even == True):
    print("YES")
else:
    print("NO")
```

## [Последовательность Фибоначчи 🌶️](https://stepik.org/lesson/294243/step/15?unit=275922)

Напишите программу, которая считывает натуральное число nn и выводит первые nn чисел последовательности Фибоначчи.

```python
n = int(input())
a, b = 1, 1

for i in range(n):
    print(a, end=' ')
    a, b = b, a + b
```