# Тема урока: цикл while
## [Обратный порядок 1](https://stepik.org/lesson/265122/step/4?unit=246071)

Дано натуральное число. Напишите программу, которая выводит его цифры в столбик в обратном порядке.

**Формат входных данных**   
На вход программе подается одно натуральное число.

**Формат выходных данных**  
Программа должна вывести цифры введенного числа в столбик в обратном порядке.

```python
number = int(input())
while number != 0:
    n = number % 10
    print (n)
    number //= 10
```

## [Обратный порядок 2](https://stepik.org/lesson/265122/step/5?unit=246071)
Дано натуральное число. Напишите программу, которая меняет порядок цифр числа на обратный.

**Формат входных данных**   
На вход программе подается одно натуральное число.

**Формат выходных данных**  
Программа должна вывести число записанное в обратном порядке.

```python
number = int(input())
while number != 0:
    n = number % 10
    print (n, end="")
    number //= 10
```

## [max и min](https://stepik.org/lesson/265122/step/6?unit=246071)

Дано натуральное число n, (n≥10). Напишите программу, которая определяет его максимальную и минимальную цифры.

**Формат входных данных**   
На вход программе подается одно натуральное число.

**Формат выходных данных**  
Программа должна вывести максимальную и минимальную цифры введенного числа (с поясняющей надписью).

```python
number = int(input())
largest = 0
smallest = number

while number != 0:
    n = number % 10
    if (n > largest):
        largest = n
    if (n < smallest):
        smallest = n
    number //= 10
print("Максимальная цифра равна", largest)
print("Минимальная цифра равна", smallest)
```

## [Все вместе](https://stepik.org/lesson/265122/step/7?unit=246071)

Дано натуральное число. Напишите программу, которая вычисляет:
-   сумму его цифр;
-   количество цифр в нем;
-   произведение его цифр;
-   среднее арифметическое его цифр;
-   его первую цифру;
-   сумму его первой и последней цифры.

**Формат входных данных**   
На вход программе подается одно натуральное число.

**Формат выходных данных**  
Программа должна вывести значения указанных величин в указанном порядке.

```python
number = int(input())

sum = 0
count = 0
mult = 1
first = 0
last = 0

while number != 0:
    n = number % 10

    if (count == 0):
        last = n

    sum += n
    count += 1
    mult *= n
    
    first = n

    number //= 10

print(sum, count, mult, sum / count, first, first + last, sep="\n")
```


## Вторая цифра

Дано натуральное число n (n>9). Напишите программу, которая определяет его вторую (с начала) цифру.

**Формат входных данных**   
На вход программе подается одно натуральное число, состоящее как минимум из двух цифр.

**Формат выходных данных**  
Программа должна вывести его вторую (с начала) цифру.

```python
number = int(input())

first = 0
second = 0

while number != 0:
    n = number % 10

    second = first
    first = n

    number //= 10

print(second)
```

## [Одинаковые цифры](https://stepik.org/lesson/265122/step/9?unit=246071)

Дано натуральное число. Напишите программу, которая определяет, состоит ли указанное число из одинаковых цифр.

**Формат входных данных**   
На вход программе подается одно натуральное число.

**Формат выходных данных**  
Программа должна вывести «YES» если число состоит из одинаковых цифр и «NO» в противном случае.

```python
number = int(input())

is_same_digit = True

temp = number % 10
number //= 10

while number != 0:
    n = number % 10

    if n != temp:
        is_same_digit = False

    number //= 10

if (is_same_digit == True):
    print("YES")
else: 
    print("NO")
```


## [Упорядоченные цифры 🌶️](https://stepik.org/lesson/265122/step/10?unit=246071)

Дано натуральное число. Напишите программу, которая определяет, является ли последовательность его цифр при просмотре справа налево упорядоченной по неубыванию.

**Формат входных данных**   
На вход программе подается одно натуральное число.

**Формат выходных данных**  
Программа должна вывести «YES» если последовательность его цифр при просмотре справа налево является упорядоченной по неубыванию и «NO» в противном случае.

```python
number = int(input())

is_sorted = True

temp = number % 10
number //= 10

while number != 0:
    n = number % 10

    if (n < temp):
        is_sorted = False

    temp = n

    number //= 10

if (is_sorted == True):
    print("YES")
else: 
    print("NO")
```

