# Тема урока: break, continue, else

## Наименьший делитель

На вход программе подается число n>1. Напишите программу, которая выводит его наименьший отличный от 1 делитель.

**Формат входных данных**  
На вход программе подается одно натуральное число nn.

**Формат выходных данных**  
Программа должна вывести наименьший делитель отличный от 1.

**Примечание.** Используйте оператор `break` при обнаружении делителя.

```python
number = int(input())
for i in range(2, number + 1):
    if (number % i == 0):
        print(i)
        break
```

## [Следуй правилам](https://stepik.org/lesson/298794/step/8?unit=280621)

На вход программе подается натуральное число n. Напишите программу, которая выводит числа от 1 до n включительно за исключением:
-   чисел от 5 до 9 включительно;
-   чисел от 17 до 37 включительно;
-   чисел от 78 до 87 включительно.

**Формат входных данных**  
На вход программе подается одно натуральное число nn.

**Формат выходных данных**  
Программа должна вывести числа в соответствии с условием задачи, каждое на отдельной строке.

**Примечание.** Используйте оператор `continue` .

```python
number = int(input())
for i in range(1, number + 1):
    if (5 <= i <= 9 or 17 <= i <= 37 or 78 <= i <= 87):
        continue
    print(i)
```

