# Тема урока: вложенные циклы
## [Таблица-1](https://stepik.org/lesson/298795/step/5?unit=280622)

Дано натуральное число n (n≤ 9). Напишите программу, которая печатает таблицу размером n×3 состоящую из данного числа (числа отделены одним пробелом).

**Формат входных данных**  
На вход программе подается одно натуральное число.

**Формат выходных данных**  
Программа должна вывести таблицу размером n×3 состоящую из данного числа.

**Примечание.** В конце строки может быть пробел.

```python
n = int(input())
for i in range(n):
    for j in range(3):
        print(n, end=" ")
    print()
```

## [Таблица-2](https://stepik.org/lesson/298795/step/6?unit=280622)

Дано натуральное число n (n≤ 9). Напишите программу, которая печатает таблицу размером n×5, где в i-ой строке указано число i (числа отделены одним пробелом).

**Формат входных данных**  
На вход программе подается одно натуральное число.

**Формат выходных данных**  
Программа должна вывести таблицу размером n×5 в соответствии с условием.

**Примечание.** В конце строки может быть пробел.

```python
n = int(input())
for i in range(1, n + 1):
    for j in range(5):
        print(i, end=" ")
    print()
```

## [Таблица-3](https://stepik.org/lesson/298795/step/7?unit=280622)

Дано натуральное число n (n≤ 9). Напишите программу, которая печатает таблицу сложения для всех чисел от 1 до n в соответствии с примером.
```
1 + 1 = 2
1 + 2 = 3
1 + 3 = 4
1 + 4 = 5
1 + 5 = 6
1 + 6 = 7
1 + 7 = 8
1 + 8 = 9
1 + 9 = 10
```

**Формат входных данных**  
На вход программе подается одно натуральное число.

**Формат выходных данных**  
Программа должна вывести таблицу сложения для всех чисел от 11 до nn.

**Примечание.** В конце строки может быть пробел.

```pytnon
n = int(input())
for i in range(1, n + 1):
    for j in range(1, 10):
        print(i, "+", j, "=", i + j)
    print()
```


## Звездный треугольник 🌶️🌶️

Дано нечетное натуральное число nn. Напишите программу, которая печатает [равнобедренный](https://ru.wikipedia.org/wiki/%D0%A0%D0%B0%D0%B2%D0%BD%D0%BE%D0%B1%D0%B5%D0%B4%D1%80%D0%B5%D0%BD%D0%BD%D1%8B%D0%B9_%D1%82%D1%80%D0%B5%D1%83%D0%B3%D0%BE%D0%BB%D1%8C%D0%BD%D0%B8%D0%BA) звездный треугольник с основанием, равным nn в соответствии с примером:

```no-highlight
*
**
***
****
***
**
*
```

**Формат входных данных**  
На вход программе подается одно нечетное натуральное число.

**Формат выходных данных**  
Программа должна вывести треугольник в соответствии с условием.

**Примечание.** Используйте вложенный цикл `for`.

```python
from math import ceil
n = int(input())
for i in range(1, n + 1):
    if (i <= ceil(n / 2)):
        k = i
    else:
        k = n - i + 1
    for j in range(1, k + 1):
        print("*", end="")
    print()
```

```python
n = int(input())
for i in range(1, n + 1):
    print('*' * min(i, n - i + 1))
```

## Численный треугольник 1

Дано натуральное число nn. Напишите программу, которая печатает численный треугольник в соответствии с примером:

```no-highlight
1
22
333
4444
55555
...
```

**Формат входных данных**  
На вход программе подается одно натуральное число.

**Формат выходных данных**  
Программа должна вывести треугольник в соответствии с условием.

**Примечание.** Используйте вложенный цикл `for`.

```python
n = int(input())
for i in range(n):
    for j in range(i + 1):
        print(i + 1, end="")
    print()
```

