# Тема урока: вложенные циклы 2
## [Численный треугольник 3](https://stepik.org/lesson/298796/step/1?unit=280623)

Дано натуральное число nn. Напишите программу, которая печатает численный треугольник с высотой равной nn, в соответствии с примером:

```no-highlight
1
2 3
4 5 6
7 8 9 10
11 12 13 14 15
16 17 18 19 20 21
...

```

**Формат входных данных**  
На вход программе подается одно натуральное число.

**Формат выходных данных**  
Программа должна вывести треугольник в соответствии с условием.

**Примечание.** Используйте вложенный цикл `for`.

```python
n = int(input())

counter = 1
for i in range(n):
    for j in range(i + 1):
        print(counter, end=" ")
        counter += 1
    print()
```

## [Численный треугольник 4](https://stepik.org/lesson/298796/step/2?unit=280623)

Дано натуральное число nn. Напишите программу, которая печатает численный треугольник с высотой равной nn, в соответствии с примером:

```no-highlight
1
121
12321
1234321
123454321
...
```

**Формат входных данных**  
На вход программе подается одно натуральное число.

**Формат выходных данных**  
Программа должна вывести треугольник в соответствии с условием.

**Примечание.** Используйте вложенный цикл `for`.

```python
n = int(input())
for i in range(1, n + 1):
    for j in range(1, i):
        print(j, end="")
    for j in range(i, 0, -1):
        print(j, end="")
    print()
```

## [Делители-1 🌶️](https://stepik.org/lesson/298796/step/3?unit=280623)

На вход программе подается два натуральных числа a и b (a < b). Напишите программу, которая находит натуральное число из отрезка [a;b] с максимальной суммой делителей.

**Формат входных данных**  
На вход программе подаются два числа, каждое на отдельной строке.

**Формат выходных данных**  
Программа должна вывести два числа на одной строке, разделенных пробелом: число с максимальной суммой делителей и сумму его делителей.

**Примечание.** Если таких чисел несколько, то выведите наибольшее из них.

```python
a,b = int(input()), int(input())

max_count = 0
max_num = 0
max_sum = 0

for i in range(a, b + 1):
    count = 0
    sum = 0
    for j in range(1, i + 1):
        if (i % j == 0):
            count += 1
            sum += j
    if (sum >= max_sum):
        max_count = count
        max_sum = sum
        max_num = i

print(max_num, max_sum)
```

## [Делители-2](https://stepik.org/lesson/298796/step/4?unit=280623)

На вход программе подается натуральное число nn. Напишите программу, выводящую графическое изображение делимости чисел от 1 до n включительно. В каждой строке надо напечатать очередное число и столько символов «+», сколько делителей у этого числа.

**Формат входных данных**  
На вход программе подается одно натуральное число.

**Формат выходных данных**  
Программа должна вывести графическое изображение чисел от 1 до n, каждое на отдельной строке.

```python
a = int(input())

for i in range(1, a + 1):
    count = 0
    for j in range(1, i + 1):
        if (i % j == 0):
            count += 1
    print(i, "+" * count, sep="")
```

## [Цифровой корень](https://stepik.org/lesson/298796/step/5?unit=280623)

На вход программе подается натуральное число nn. Напишите программу, которая находит цифровой корень данного числа. Цифровой корень числа nn получается следующим образом: если сложить все цифры этого числа, затем все цифры найденной суммы и повторить этот процесс, то в результате будет получено однозначное число (цифра), которое и называется цифровым корнем данного числа.

**Формат входных данных**  
На вход программе подается одно натуральное число.

**Формат выходных данных**  
Программа должна вывести цифровой корень введенного числа.

**Примечание.** Используйте вложенные циклы `while`.

```python
n = int(input())

while n >= 10:
    number_sum = 0
    while(n != 0):
        x = n % 10
        number_sum += x
        n //= 10
    n = number_sum
print(n)   
```

## [Сумма факториалов](https://stepik.org/lesson/298796/step/6?unit=280623)

Дано натуральное число n. Напишите программу, которая выводит значение суммы 1!+2!+3!+…+n!.

**Формат входных данных**  
На вход программе подается одно натуральное число.

**Формат выходных данных**  
Программа должна вывести значение суммы 1!+2!+3!+…+n!.

```python
from math import factorial
n = int(input())
sum = 0
for i in range(1, n + 1):
    sum += factorial(i)
print(sum)
```

## [Простые числа](https://stepik.org/lesson/298796/step/7?unit=280623)

На вход программе подается два натуральных числа aa и bb (a < b). Напишите программу, которая находит все простые числа от a до b включительно.

**Формат входных данных**  
На вход программе подаются два числа, каждое на отдельной строке.

**Формат выходных данных**  
Программа должна вывести все простые числа от a до b включительно, каждое на отдельной строке.

**Примечание.** Число 1 простым не является.

```python
a, b = int(input()), int(input())

for i in range(max(2, a), b + 1):
    for j in range(1, i + 1):
        if (i % j == 0 and j != 1 and j != i):
            break
    else:
        print(i)
```