# Тема урока: строки

## [-](https://stepik.org/lesson/284101/step/5?unit=265440)
Дополните приведенный код, используя индексатор, так чтобы он вывел символ запятой.

```python
s = "In 2010, someone paid 10k Bitcoin for two pizzas."

print(s[7])
```

## [-](https://stepik.org/lesson/284101/step/6?unit=265440)
Дополните приведенный код, используя индексатор, так чтобы он вывел символ `w`.

``` python
s = "In 2010, someone paid 10k Bitcoin for two pizzas."

print(s[-10])
```

## [В столбик 1](https://stepik.org/lesson/284101/step/7?unit=265440)

На вход программе подается одна строка. Напишите программу, которая выводит элементы строки с индексами `0, 2, 4, ...` в столбик.

**Формат входных данных**  
На вход программе подается одна строка.

**Формат выходных данных**  
Программа должна вывести элементы строки с индексами `0, 2, 4, ...`, каждое на отдельной строке.

```python
str = input()
for i in range(0, len(str), 2):
    print(str[i])
```

## [В столбик 2](https://stepik.org/lesson/284101/step/8?unit=265440)

На вход программе подается одна строка. Напишите программу, которая выводит в столбик элементы строки в обратном порядке.

**Формат входных данных**  
На вход программе подается одна строка.

**Формат выходных данных**  
Программа должна вывести в столбик элементы строки в обратном порядке.

```python
str = input()
for i in range(1, len(str) + 1):
    print(str[-i])
```

## [ФИО](https://stepik.org/lesson/284101/step/9?unit=265440)

На вход программе подаются три строки: имя, фамилия и отчество. Напишите программу, которая выводит инициалы человека.

**Формат входных данных**  
На вход программе подаются три строки, каждая на отдельной строке.

**Формат выходных данных**  
Программа должна вывести ФИО человека.

**Примечание.** Гарантируется, что имя, фамилия и отчество начинаются с заглавной буквы.

```python
name, lastName, secondName = input(), input(), input()
print(lastName[0], name[0], secondName[0], sep="")
```

## [Цифра 1](https://stepik.org/lesson/284101/step/10?unit=265440)
На вход программе подается одна строка состоящая из цифр. Напишите программу, которая считает сумму цифр данной строки.

**Формат входных данных**  
На вход программе подается одна строка состоящая из цифр.

**Формат выходных данных**  
Программа должна вывести сумму цифр данной строки.

```python
str, sum = input(), 0
for c in str:
    sum += int(c)
print(sum)
```

## [Цифра 2](https://stepik.org/lesson/284101/step/11?unit=265440)

На вход программе подается одна строка. Напишите программу, которая выводит сообщение «Цифра» (без кавычек), если строка содержит цифру. В противном случае вывести сообщение «Цифр нет» (без кавычек).

**Формат входных данных**  
На вход программе подается одна строка.

**Формат выходных данных**  
Программа должна вывести текст в соответствии с условием задачи.

```python
str, digits = input(), "0123456789"
for c in digits:
    if (c in str):
        print("Цифра")
        break
else:
    print("Цифр нет")
```

## [Сколько раз?](https://stepik.org/lesson/284101/step/12?unit=265440)

На вход программе подается одна строка. Напишите программу, которая определяет сколько раз в строке встречаются символы `+` и `*`.

**Формат входных данных**  
На вход программе подается одна строка.

**Формат выходных данных**  
Программа должна вывести сколько раз встречаются символы  `+` и `*` в строке.

```python
str, plus_counter, mult_counter = input(), 0, 0
for c in str:
    if (c == "+"):
        plus_counter += 1
    elif (c == "*"):
        mult_counter += 1
print("Символ + встречается", plus_counter, "раз")
print("Символ * встречается", mult_counter, "раз")
```

## [Одинаковые соседи](https://stepik.org/lesson/284101/step/13?unit=265440)

На вход программе подается одна строка. Напишите программу, которая определяет сколько в ней одинаковых соседних символов.

**Формат входных данных**  
На вход программе подается одна строка.

**Формат выходных данных**  
Программа должна вывести количество одинаковых соседних символов.

```python
str, counter = input(), 0
for i in range(1, len(str)):
    if (str[i] == str[i - 1]):
        counter += 1
print(counter)
```

## [Гласные и согласные](https://stepik.org/lesson/284101/step/14?unit=265440)

На вход программе подается одна строка с буквами русского языка. Напишите программу, которая определяет количество гласных и согласных букв.

**Формат входных данных**  
На вход программе подается одна строка.

**Формат выходных данных**  
Программа должна вывести количество гласных и согласных букв.

**Примечание.** В русском языке 10 гласных букв (а, у, о, ы, и, э, я, ю, ё, е) и 21 согласная буква (б, в, г, д, ж, з, й, к, л, м, н, п, р, с, т, ф, х, ц, ч, ш, щ).

```python
str, vowels, vovels_counter, consonant, consonant_count = input(), "ауоыиэяюёеАУОЫИЭЯЮЁЕ", 0, "бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ", 0
for c in str:
    if (c in vowels):
        vovels_counter += 1
    elif (c in consonant):
        consonant_count += 1
print("Количество гласных букв равно", vovels_counter)
print("Количество согласных букв равно", consonant_count)
```

## [Decimal to Binary](https://stepik.org/lesson/284101/step/15?unit=265440)

На вход программе подается натуральное число, записанное в десятичной системе счисления. Напишите программу, которая переводит данное число в [двоичную систему счисления](https://ru.wikipedia.org/wiki/%D0%94%D0%B2%D0%BE%D0%B8%D1%87%D0%BD%D0%B0%D1%8F_%D1%81%D0%B8%D1%81%D1%82%D0%B5%D0%BC%D0%B0_%D1%81%D1%87%D0%B8%D1%81%D0%BB%D0%B5%D0%BD%D0%B8%D1%8F).

**Формат входных данных**  
На вход программе подается одно натуральное число.

**Формат выходных данных**  
Программа должна вывести число записанное в двоичной системе счисления.

```python
number = int(input())
result = ""

while number != 0:
    result = str(number % 2) + result
    number = number // 2
print(result)
```

