# Тема урока: строки
## [Заглавные буквы](https://stepik.org/lesson/296416/step/8?unit=278136)

На вход программе подается строка состоящая из имени и фамилии человека, разделенных одним пробелом. Напишите программу, которая проверяет, что имя и фамилия начинаются с заглавной буквы.

**Формат входных данных**   
На вход программе подается строка.

**Формат выходных данных**  
Программа должна вывести «YES» если имя и фамилия начинаются с заглавной буквы и «NO» в противном случае.

**Примечание.** Строка содержит только буквы.

```python
input = input()
if (input == input.title()):
    print("YES")
else:
    print("NO")
```

## [sWAP cASE](https://stepik.org/lesson/296416/step/9?unit=278136)

На вход программе подается строка. Напишите программу, которая меняет регистр символов, другими словами замените все строчные символы заглавными и наоборот.

**Формат входных данных**   
На вход программе подается строка.

**Формат выходных данных**  
Программа должна вывести строку в соответствии с условием задачи.

```python
print(input().swapcase())
```

## [Хороший оттенок](https://stepik.org/lesson/296416/step/10?unit=278136)

На вход программе подается строка текста. Напишите программу, которая определяет является ли оттенок текста хорошим или нет. Текст имеет хороший оттенок, если содержит подстроку «хорош» во всевозможных регистрах.

**Формат входных данных**   
На вход программе подается строка текста.

**Формат выходных данных**  
Программа должна вывести «YES» если текст имеет хороший оттенок и «NO» в противном случае.

**Примечание.** Текст содержащий хорош, ХОРОШ, Хорош, хОРОШ и т.д. имеет хороший оттенок.

```python
if "хорош" in input().lower():
    print("YES")
else:
    print("NO")
```

## [Нижний регистр](https://stepik.org/lesson/296416/step/11?unit=278136)

На вход программе подается строка. Напишите программу, которая подсчитывает количество буквенных символов в нижнем регистре.

**Формат входных данных**   
На вход программе подается строка.

**Формат выходных данных**  
Программа должна вывести количество буквенных символов в нижнем регистре.
```python
str = input()
counter = 0

for c in str:
    if (c != c.upper()):
        counter += 1
print(counter)
```

