## [-](https://stepik.org/lesson/313233/step/1?unit=295750)
Вставьте пропущенный фрагмент кода, так чтобы в результате выполнения программы была выведена длина строки `s`.
```python
s = 'Python rocks!'
print(len(s))
```

## [-](https://stepik.org/lesson/313233/step/2?unit=295750)
Вставьте пропущенный фрагмент кода, так чтобы в результате выполнения программы был выведен четвертый символ строки `s`.
```python
s = 'Python rocks!'
print(s[3])
```

## [-](https://stepik.org/lesson/313233/step/3?unit=295750)
Вставьте пропущенный фрагмент кода, так чтобы в результате выполнения программы были выведены символы строки `s` со 2 по 5 включительно.
```python
s = 'Python rocks!'
print(s[1:5])
```

## [-](https://stepik.org/lesson/313233/step/4?unit=295750)
Вставьте пропущенный фрагмент кода, так чтобы в результате выполнения программы была выведена строка `s` без ведущих и замыкающих пробельных символов.
```python
s = '    Python rocks!     '
print(s.strip())
```

## [-](https://stepik.org/lesson/313233/step/5?unit=295750)
Вставьте пропущенный фрагмент кода, так чтобы в результате выполнения программы была выведена строка `s` заглавными буквами (в верхнем регистре).
```python
s = 'Python rocks!'
print(s.upper())
```

## [-](https://stepik.org/lesson/313233/step/6?unit=295750)
Вставьте пропущенный фрагмент кода, так чтобы в результате выполнения программы была выведена строка `s` в которой символ «o» заменен на символ «@».
```python
s = 'Python rocks!'
print(s.replace("o", "@"))
```

## [Каждый третий](https://stepik.org/lesson/313233/step/7?unit=295750)

На вход программе подается строка текста. Напишите программу, которая удаляет из нее все символы с индексами кратными 3, то есть символы с индексами `0, 3, 6, ...`.

**Формат входных данных**   
На вход программе подается строка текста.

**Формат выходных данных**  
Программа должна вывести строку текста в соответствии с условием задачи.

```python
input = input()
result = ""
for i in range(len(input)):
    if (i % 3 != 0):
        result += input[i]
print(result)
```

## [Замени меня полностью](https://stepik.org/lesson/313233/step/8?unit=295750)

На вход программе подается строка текста. Напишите программу, которая заменяет все вхождения цифры 1 на слово «one».

**Формат входных данных**   
На вход программе подается строка текста.

**Формат выходных данных**  
Программа должна вывести текст в соответствии с условием задачи.

```python
input = input()
print(input.replace("1", "one"))
```

## [Удали меня полностью](https://stepik.org/lesson/313233/step/9?unit=295750)

На вход программе подается строка текста. Напишите программу, которая удаляет все вхождения символа «@».

**Формат входных данных**   
На вход программе подается строка текста.

**Формат выходных данных**  
Программа должна вывести текст в соответствии с условием задачи.

```python
input = input()
print(input.replace("@", ""))
```

## [Второе вхождение](https://stepik.org/lesson/313233/step/10?unit=295750)

На вход программе подается строка текста. Напишите программу, которая выводит индекс второго вхождения буквы «f». Если буква «f» встречается только один раз, выведите число -1, а если не встречается ни разу, выведите число -2.

**Формат входных данных**   
На вход программе подается строка текста.

**Формат выходных данных**  
Программа должна вывести текст в соответствии с условием задачи.

```python
input = input()
f_syb = "f"

if (input.count(f_syb) == 0):
    print(-2)
elif (input.count(f_syb) == 1):
    print(-1)
else:
    first = input.find(f_syb)
    print(input.find(f_syb, first + 1))
```

## [Переворот](https://stepik.org/lesson/313233/step/11?unit=295750)

На вход программе подается строка текста в которой буква «h» встречается как минимум два раза. Напишите программу, которая возвращает исходную строку и переворачивает последовательность символов, заключенную между первым и последним вхождением буквы «h».

**Формат входных данных**   
На вход программе подается строка текста.

**Формат выходных данных**  
Программа должна вывести текст в соответствии с условием задачи.

```python
input = input()
syb = "h"

first = input.index(syb)
second = input.rindex(syb)

print(input[:first] + input[second:first:-1] + input[second:])
```

