# Тема урока: введение в списки
## Список чисел

На вход программе подается одно число nn. Напишите программу, которая выводит список `[1, 2, 3, ..., n]`.

**Формат входных данных**  
На вход программе подается одно натуральное число.

**Формат выходных данных**  
Программа должна вывести текст в соответствии с условием задачи.

```python
print(list(range(1, int(input()) + 1)))
```

## [Список букв](https://stepik.org/lesson/324750/step/9?unit=307926)

На вход программе подается одно число nn. Напишите программу, которая выводит список, состоящий из nn букв английского алфавита `['a', 'b', 'c', ...]` в нижнем регистре.

**Формат входных данных**  
На вход программе подается натуральное число n,n≤26.

**Формат выходных данных**  
Программа должна вывести текст в соответствии с условием задачи.

```python
n = int(input())
str = ""
for i in range(0, n):
    str += chr(i + 97)
print(list(str))
```
