# Тема урока: методы добавления и удаления элементов
## [Все сразу 1 🌶️](https://stepik.org/lesson/327207/step/6?unit=310501)

Дополните приведенный код, чтобы он:

1.  Вывел длину списка;
2.  Вывел последний элемент списка;
3.  Вывел список в обратном порядке (вспоминаем срезы);
4.  Вывел `YES` если список содержит числа 5 и 17, и `NO` в противном случае;
5.  Вывел список с удаленным первым и последним элементами.

**Примечание.** Каждый вывод осуществлять с новой строки.

```python
numbers = [2, 6, 3, 14, 10, 4, 11, 16, 12, 5, 4, 16, 1, 0, 8, 16, 10, 10, 8, 5, 1, 11, 10, 10, 12, 0, 0, 6, 14, 8, 2, 12, 14, 5, 6, 12, 1, 2, 10, 14, 9, 1, 15, 1, 2, 14, 16, 6, 7, 5]

print(len(numbers))
print(numbers[-1])
print(numbers[::-1])
if (5 in numbers and 17 in numbers):
    print("YES")
else:
    print("NO")
del numbers[0]
del numbers[-1]
print(numbers)
```

## [Список строк](https://stepik.org/lesson/327207/step/7?unit=310501)

На вход программе подается натуральное число nn, а затем nn строк. Напишите программу, которая создает из указанных строк список и выводит его.

**Формат входных данных**  
На вход программе подаются натуральное число nn, а затем nn строк, каждая на отдельной строке.

**Формат выходных данных**  
Программа должна вывести список состоящий из указанных строк.

```python
n, list = int(input()), []
for i in range(n):
    list.append(input())
print(list)
```

## [Алфавит](https://stepik.org/lesson/327207/step/8?unit=310501)

Напишите программу, выводящую следующий список:

```no-highlight
['a', 'bb', 'ccc', 'dddd', 'eeeee', 'ffffff', ...]
```

**Формат выходных данных**  
Программа должна вывести указанный список.

**Примечание.** Последний элемент списка состоит из 26 символов `z`.

```python
list = []
for i in range(1, 27):
    list.append(chr(i + 96) * i)
print(list)
```

## [Список кубов](https://stepik.org/lesson/327207/step/9?unit=310501)

На вход программе подается натуральное число nn, а затем nn целых чисел. Напишите программу, которая создает из указанных чисел список их кубов.

**Формат входных данных**  
На вход программе подаются натуральное число nn, а затем nn целых чисел, каждое на отдельной строке.

**Формат выходных данных**  
Программа должна вывести список, состоящий из кубов указанных чисел.

```python
n, list = int(input()), []
for i in range(n):
    list.append(int(input()) ** 3)
print(list)
```

## [Список делителей](https://stepik.org/lesson/327207/step/10?unit=310501)

На вход программе подается натуральное число nn. Напишите программу, которая создает список состоящий из делителей введенного числа.

**Формат входных данных**  
На вход программе подается натуральное число nn.

**Формат выходных данных**  
Программа должна вывести список, состоящий из делителей введенного числа.

```python
n, list = int(input()), []
for i in range(1, n + 1):
    if (n % i == 0):
        list.append(i)
print(list)
```

## [Суммы двух](https://stepik.org/lesson/327207/step/11?unit=310501)

На вход программе подается натуральное число n≥2, а затем n целых чисел. Напишите программу, которая создает из указанных чисел список, состоящий из сумм соседних чисел (0 и 1, 11и 2, 22и 3 и т.д.).

**Формат входных данных**  
На вход программе подаются натуральное число nn, а затем nn целых чисел, каждое на отдельной строке.

**Формат выходных данных**  
Программа должна вывести список, состоящий из сумм соседних чисел.

```python
n, list1, list2 = int(input()), [], []
for i in range(1, n + 1):
    list1.append(int(input()))

for i in range(1, len(list1)):
    list2.append(list1[i] + list1[i - 1])
print(list2)
```

## [Удалите нечетные индексы](https://stepik.org/lesson/327207/step/12?unit=310501)

На вход программе подается натуральное число nn, а затем nn целых чисел. Напишите программу, которая создает из указанных чисел список, затем удаляет все элементы стоящие по нечетным индексам, а затем выводит полученный список.

**Формат входных данных**  
На вход программе подаются натуральное число nn, а затем nn целых чисел, каждое на отдельной строке.

**Формат выходных данных**  
Программа должна вывести список в соответствии с условием задачи.

**Примечание.** Используйте оператор `del`.

```python
n, list1 = int(input()), []
for i in range(n):
    list1.append(int(input()))
del list1[1::2]
print(list1)
```

## [k-ая буква слова 🌶️🌶️](https://stepik.org/lesson/327207/step/13?unit=310501)

На вход программе подается натуральное число n и n строк, а затем число k. Напишите программу, которая выводит k-ую букву из введенных строк на одной строке без пробелов.

**Формат входных данных**  
На вход программе подается натуральное число n,  далее n строк, каждая на отдельной строке. В конце вводится натуральное число k – номер буквы (нумерация начинается с единицы).

**Формат выходных данных**  
Программа должна вывести текст в соответствии с условием задачи.

**Примечание.** Если некоторые строки слишком короткие, и в них нет символа с заданным номером, то такие строки при выводе нужно игнорировать.

```python
n = int(input())
list = []

for i in range(n):
    list.append(input())

k = int(input())

for item in list:
    if (k - 1 < len(item)):
        print(item[k - 1], end="")
```

## [Символы всех строк](https://stepik.org/lesson/327207/step/14?unit=310501)

На вход программе подается натуральное число n, а затем n строк. Напишите программу, которая создает список из символов всех строк, а затем выводит его.

**Формат входных данных**  
На вход программе подаются натуральное число n, а затем n строк, каждая на отдельной строке.

**Формат выходных данных**  
Программа должна вывести список состоящий из символов всех введенных строк.

**Примечание.** В результирующем списке могут содержаться одинаковые символы.

```python
n = int(input())
list = []

for i in range(n):
    list.extend(input())
print(list)
```

