# Тема урока: строковые методы
## [Построчный вывод](https://stepik.org/lesson/324755/step/3?unit=307931)

На вход программе подается строка текста. Напишите программу, которая выводит слова введенной строки в столбик.

**Формат входных данных**  
На вход программе подается строка текста.

**Формат выходных данных**  
Программа должна вывести текст в соответствии с условием задачи.

```python
print("\n".join(input().split()))
```

## [Инициалы](https://stepik.org/lesson/324755/step/4?unit=307931)

На вход программе подается строка текста, содержащая имя, отчество и фамилию человека. Напишите программу, которая выводит инициалы человека.

**Формат входных данных**  
На вход программе подается строка текста, содержащая имя, отчество и фамилию человека.

**Формат выходных данных**  
Программа должна вывести текст в соответствии с условием задачи.

```python
str = input().split()
print(str[0][0], str[1][0], str[2][0], sep=".", end=".")
```

## [Windows OS](https://stepik.org/lesson/324755/step/5?unit=307931)

В операционной системе Windows полное имя файла состоит из буквы диска, после которого ставится двоеточие и символ  "\",  затем через такой же символ перечисляются подкаталоги (папки), в которых находится файл, в конце пишется имя файла (C:\Windows\System32\calc.exe).

На вход программе подается одна строка с корректным именем файла в операционной системе Windows. Напишите программу, которая разбирает строку на части, разделенные символом "\". Каждую часть вывести в отдельной строке.

**Формат входных данных**  
На вход программе подается одна строка.

**Формат выходных данных**  
Программа должна вывести текст в соответствии с условием задачи.

```python
print("\n".join(input().split("\\")))
```

## [Диаграмма](https://stepik.org/lesson/324755/step/6?unit=307931)

На вход программе подается строка текста, содержащая целые числа. Напишите программу, которая по заданным числам строит столбчатую диаграмму.

**Формат входных данных**  
На вход программе подается строка текста, содержащая целые числа, разделенных символом пробела.

**Формат выходных данных**  
Программа должна вывести столбчатую диаграмму.

```python
numbers = input().split()
for n in numbers:
    print("+" * int(n))
```

## [Корректный ip-адрес](https://stepik.org/lesson/324755/step/7?unit=307931)

На вход программе подается строка текста, содержащая 4 целых числа разделенных точкой. Напишите программу, которая определяет является ли введенная строка текста корректным ip-адресом.

**Формат входных данных**  
На вход программе подается строка текста, содержащая 4 целых числа разделенных точкой.

**Формат выходных данных**  
Программа должна вывести «ДА», если введеная строка является корректным ip-адресом, и «НЕТ» — в противном случае.

**Примечание.** ip-адрес является корректным, если все 4 числа находятся в диапазоне от 0 до 255 _включительно_.

```python
numbers = input().split(".")
for n in numbers:
    if not 0 <= int(n) <= 255:
        print("НЕТ")
        break
else:
    print("ДА")
```

## [Добавь разделитель](https://stepik.org/lesson/324755/step/8?unit=307931)

На вход программе подается строка текста и строка разделитель. Напишите программу, которая вставляет указанный разделитель между каждым символом введенной строки текста.

**Формат входных данных**  
На вход программе подается строка текста и строка разделитель, каждая на отдельной строке

**Формат выходных данных**  
Программа должна вывести текст в соответствии с условием задачи.

```python
list = []
list.extend(input())
print(input().join(list))
```

## [Количество совпадающих пар](https://stepik.org/lesson/324755/step/9?unit=307931)

На вход программе подается строка текста, содержащая натуральные числа. Из данной строки формируется список чисел. Напишите программу, которая подсчитывает, сколько в полученном списке пар элементов, равных друг другу. Считается, что любые два элемента, равные друг другу образуют одну пару, которую необходимо посчитать.

**Формат входных данных**  
На вход программе подается строка текста, содержащая натуральные числа, отделенные символом пробела.

**Формат выходных данных**  
Программа должна вывести одно число – количество пар элементов, равных друг другу.

```python
list, counter = input().split(), 0
for i in range(len(list)):
    for j in range(i + 1, len(list)):
        if (int(list[i]) == int(list[j])):
            counter += 1
print(counter)
```