# Тема урока: методы списков
## [Все сразу 2 🌶️](https://stepik.org/lesson/324754/step/5?unit=307930)

Дополните приведенный код, чтобы он:

1.  Заменил второй элемент списка на `17`;
2.  Добавил числа `4, 5` и `6` в конец списка;
3.  Удалил первый элемент списка;
4.  Удвоил список;
5.  Вставил число `25` по индексу 3;
6.  Вывел список, с помощью функции `print()`

```python
numbers = [8, 9, 10, 11]
numbers[1] = 17
numbers.extend([4, 5, 6])
numbers.remove(numbers[0])
numbers.extend(numbers)
numbers.insert(3, 25)
print(numbers)
```

## [Переставить min и max](https://stepik.org/lesson/324754/step/6?unit=307930)

На вход программе подается строка текста, содержащая **различные** натуральные числа. Из данной строки формируется список чисел. Напишите программу, которая меняет местами минимальный и максимальный элемент этого списка.

**Формат входных данных**  
На вход программе подается строка текста, содержащая различные натуральные числа, разделенные символом пробела.

**Формат выходных данных**  
Программа должна вывести строку текста в соответствии с условием задачи.

**Примечание.** Используйте подходящие встроенные функции и списочные методы.

```python
str = input().split()
numbers = []
for s in str:
    numbers.append(int(s))
max = numbers.index(max(numbers))
min = numbers.index(min(numbers))
numbers[max], numbers[min] = numbers[min], numbers[max]
print(*numbers)
```

## [Количество артиклей](https://stepik.org/lesson/324754/step/7?unit=307930)

На вход программе подается строка, содержащая английский текст. Напишите программу, которая подсчитывает общее количество артиклей: `'a', 'an', 'the'`.

**Формат входных данных**  
На вход программе подается строка, содержащая английский текст. Слова текста разделены символом пробела.

**Формат выходных данных**  
Программа должна вывести общее количество артиклей `'a', 'an', 'the'` вместе с поясняющим текстом.

**Примечание.** Артикли могут начинаться с заглавной буквы `'A', 'An', 'The'`.

```python
text, articles = input().lower().split(), ['a', 'an', 'the']
total_count = 0
for a in articles:
    total_count += text.count(a)
print("Общее количество артиклей:", total_count)
```

## [Взлом Братства Стали 🌶️](https://stepik.org/lesson/324754/step/8?unit=307930)

Немалоизвестный в пустошах Мохаве Курьер забрел в Хидден-Вэли – секретный бункер Братства Стали, и любезно соглашается помочь им в решении их проблем. Одной из такой проблем являлся странный компьютерный вирус, который проявлялся в виде появления комментариев к программам на терминалах Братства Стали. Известно, что программисты Братства никогда не оставляют комментарии к коду, и пишут программы на Python, поэтому удаление всех этих комментариев никак не навредит им. Помогите писцу Ибсену удалить все комментарии из программы.  
  
**Формат входных данных**  
На первой строке вводится символ решётки и сразу же натуральное число n — количество строк в программе, не считая первой. Далее следует n строк кода.  
  
**Формат выходных данных**  
Нужно вывести те же строки, но удалить комментарии и символы пустого пространства в конце строк. Пустую строку вместо первой строки ввода выводить не надо.

```python
count = int(input()[1:])
for i in range(count):
    str = input()
    if ("#" in str):
        index = str.index("#")
        str = str[:index]
        print(str.rstrip())
    else:
        print(str)
```

## [Сортировка чисел](https://stepik.org/lesson/324754/step/11?unit=307930)

На вход программе подается строка текста, содержащая целые числа. Из данной строки формируется список чисел. Напишите программу, которая сортирует и выводит данный список сначала по возрастанию, а затем по убыванию. 

**Формат входных данных**  
На вход программе подается строка текста, содержащая целые числа, разделенные символом пробела.

**Формат выходных данных**  
Программа должна вывести две строки текста в соответствии с условием задачи.

```python
str = input().split()
numbers = []
for c in str:
    numbers.append(int(c))
numbers.sort()
print(*numbers)
numbers.sort(reverse=True)
print(*numbers)
```

