## [Список четных](https://stepik.org/lesson/327221/step/1?unit=310520)

На вход программе подается четное число n,n≥2. Напишите программу, которая выводит список четных чисел

 `[2, 4, 6, ..., n]`.

**Формат входных данных**  
На вход программе подается четное натуральное число.

**Формат выходных данных**  
Программа должна вывести текст в соответствии с условием задачи.

```python
print([i for i in range(2, int(input()) + 1, 2)])
```

## [Сумма двух списков](https://stepik.org/lesson/327221/step/2?unit=310520)

На вход программе подаются две строки текста, содержащие целые числа. Из данных строк формируются списки чисел `L` и `M`. Напишите программу, которая создает третий список, элементами которого являются суммы соответствующих элементов списков `L` и `M`. Далее программа должна вывести каждый элемент полученного списка на одной строке через 1 пробел.

**Формат входных данных**  
На вход программе подаются две строки текста, содержащие целые числа, разделенные символом пробела.

**Формат выходных данных**  
Программа должна вывести текст в соответствии с условием задачи.

**Примечание.** Количество чисел в обеих строках одинаковое.

```python
l, m = [int(i) for i in input().split()], [int(i) for i in input().split()]
for i in range(len(l)):
    print(l[i] + m[i], end=" ")
```

## [Сумма чисел](https://stepik.org/lesson/327221/step/3?unit=310520)

На вход программе подается строка текста, содержащая натуральные числа. Напишите программу, которая вставляет между каждым числом знак `+`, а затем вычисляет сумму полученных чисел.

**Формат входных данных**  
На вход программе подается строка текста, содержащая натуральные числа, разделенные символом пробела.

**Формат выходных данных**  
Программа должна вывести текст в соответствии с условием задачи.

**Примечание.** Строковый метод `join()` работает только со списком строк.

```python
l = [int(i) for i in input().split()]
print(*l, sep="+", end="=")
print(sum(l))
```

## [Валидный номер 🌶️🌶️](https://stepik.org/lesson/327221/step/4?unit=310520)

На вход программе подается строка текста. Напишите программу, которая определяет является ли введенная строка корректным телефонным номером. Строка текста является корректным телефонным номером если она имеет формат:

-   `abc-def-hijk` или
-   `7-abc-def-hijk`

где `a, b, c, d, e, f, h, i, j, k` – цифры от 0 до 9.

**Формат входных данных**   
На вход программе подается строка текста.

**Формат выходных данных**  
Программа должна вывести «YES» если строка является корректным телефонным номером и «NO» в противном случае.

**Примечание.** Телефонный номер должен содержать только цифры и символ `-`, а количество цифр в каждой группе должны быть правильным.

```python
str = input().split("-")
is_valid = True

len = len(str)

for i in range(len):
    part = str[i]
    if (part.isdigit()):
        num = int(part)
        if ((len == 4 and i == 0 and num == 7) or ((len == 3 or (len == 4 and i != 0)) and 0 <= num <= 999) or (i == len - 1 and 0 <= num <= 9999)):
            continue

    is_valid = False
    break

if (is_valid):
    print("YES")
else:
    print("NO")
```

## [Самый длинный](https://stepik.org/lesson/327221/step/5?unit=310520)

На вход программе подается строка текста. Напишите программу, **использующую списочное выражение**, которая находит длину самого длинного слова.

**Формат входных данных**  
На вход программе подается строка текста.

**Формат выходных данных**  
Программа должна вывести текст в соответствии с условием задачи.

```python
print(max([len(i) for i in input().split()]))
```

## [Молодежный жаргон](https://stepik.org/lesson/327221/step/6?unit=310520)

На вход программе подается строка текста. Напишите программу, **использующую списочное выражение**, которая преобразует каждое слово введенного текста в "молодежный жаргон" по следующему правилу: 

1.  первая буква каждого слова удаляется и ставится в конец слова; 
2.  затем в конец слова добавляется слог "ки".

**Формат входных данных**  
На вход программе подается строка текста на русском языке.

**Формат выходных данных**  
Программа должна вывести текст в соответствии с условием задачи.

```python
words = [i for i in input().split()]
for w in words:
   print(w[1:] + w[0] + "ки", end=" ")
```
