# Тема урока: функции с возвратом значения
## [Конвертер километров](https://stepik.org/lesson/331754/step/6?unit=315133)

Напишите функцию `convert_to_miles(km)`, которая принимает в качестве аргумента расстояние в километрах и возвращает расстояние в милях. Формула для преобразования: `мили = километры * 0.6214`.

```python
# объявление функции
def convert_to_miles(km):
    return km * 0.6214

# считываем данные
num = int(input())

# вызываем функцию
print(convert_to_miles(num))
```

## [Количество дней](https://stepik.org/lesson/331754/step/7?unit=315133)

Напишите функцию `get_days(month)`, которая принимает в качестве аргумента номер месяца и возвращает количество дней в данном месяце.

**Примечание 1.** Гарантируется, что передаваемый аргумент находится в диапазоне от 1 до 12.

**Примечание 2.** Считайте, что год является невисокосным.

```python
# объявление функции
def get_days(month):
    return [31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31][month - 1]

# считываем данные
num = int(input())

# вызываем функцию
print(get_days(num))
```

## [Делители 1](https://stepik.org/lesson/331754/step/8?unit=315133)

Напишите функцию `get_factors(num)`, принимающую в качестве аргумента натуральное число и возвращающую список всех делителей данного числа.

```python
# объявление функции
def get_factors(num):
    return [i for i in range(1, num + 1) if num % i == 0]

# считываем данные
n = int(input())

# вызываем функцию
print(get_factors(n))
```

## [Делители 2](https://stepik.org/lesson/331754/step/9?unit=315133)

Напишите функцию `number_of_factors(num)`, принимающую в качестве аргумента число и возвращающую количество делителей данного числа.

**Примечание 1.** Используйте уже реализованную функцию `get_factors(num)` из предыдущей задачи.

```python
# объявление функции
def get_factors(num):
    return [i for i in range(1, num + 1) if num % i == 0]

# объявление функции
def number_of_factors(num):
    return len(get_factors(num))

# считываем данные
n = int(input())

# вызываем функцию
print(number_of_factors(n))
```

## [Найти всех](https://stepik.org/lesson/331754/step/10?unit=315133)

Напомним, что строковый метод `find('a')` возвращает местоположение первого вхождения символа `a` в строке. Проблема заключается в том, что данный метод не находит местоположение всех символов `а`.

Напишите функцию с именем `find_all(target, symbol)`, которая принимает два аргумента: строку `target` и символ `symbol` и возвращает список, содержащий все местоположения этого символа в строке.

**Примечание 1.** Если указанный символ не встречается в строке, то следует вернуть пустой список.

## [Merge lists 1](https://stepik.org/lesson/331754/step/11?unit=315133)

Напишите функцию `merge(list1, list2)`, которая принимает в качестве аргументов два отсортированных по возрастанию списка, состоящих из целых чисел, и объединяет их в один отсортированный список.

**Примечание 1.** Списки `list1` и `list2` могут иметь разную длину.

**Примечание 2.** Можно использовать списочный метод `sort()`, а можно обойтись и без него 😎.

```python
# объявление функции
def merge(list1, list2):
    list1.extend(list2)
    list1.sort()
    return list1

# считываем данные
numbers1 = [int(c) for c in input().split()]
numbers2 = [int(c) for c in input().split()]

# вызываем функцию
print(merge(numbers1, numbers2))
```

## [Merge lists 2](https://stepik.org/lesson/331754/step/13?unit=315133)

На вход программе подается число nn, а затем nn строк, содержащих целые числа **в порядке возрастания**. Из данных строк формируются списки чисел. Напишите программу, которая объединяет указанные списки в один отсортированный список с помощью функции `quick_merge()`, а затем выводит его.

**Формат входных данных**  
На вход программе подается натуральное число nn, а затем nn строк, содержащих целые числа в порядке возрастания, разделенные символом пробела.

**Формат выходных данных**  
Программа должна вывести текст в соответствии с условием задачи.

```python
def quick_merge(list1, list2):
    result = []

    p1 = 0  # указатель на первый элемент списка list1
    p2 = 0  # указатель на первый элемент списка list2

    while p1 < len(list1) and p2 < len(list2):  # пока не закончился хотя бы один список
        if list1[p1] <= list2[p2]:
            result.append(list1[p1])
            p1 += 1
        else:
            result.append(list2[p2])
            p2 += 1

    if p1 < len(list1):   # прицепление остатка
        result += list1[p1:]
    if p2 < len(list2):
        result += list2[p2:]
    
    return result

result = []
n = int(input())
for i in range(n):
    list = [int(j) for j in input().split()]
    result = quick_merge(result, list)
print(*result)
```

