## [Угадайка чисел](https://stepik.org/lesson/349845/step/1?unit=333700)

**Описание проекта**: программа генерирует случайное число в диапазоне от 11 до 100100 и просит пользователя угадать это число. Если догадка пользователя больше случайного числа, то программа должна вывести сообщение `'Слишком много, попробуйте еще раз'`. Если догадка меньше случайного числа, то программа должна вывести сообщение `'Слишком мало, попробуйте еще раз'`. Если пользователь угадывает число, то программа должна поздравить его и вывести сообщение `'Вы угадали, поздравляем!'`.

**Составляющие проекта:**

-   Целые числа (тип `int`);
-   Переменные;
-   Ввод / вывод данных (функции `input()` и `print()`);
-   Условный оператор (`if/elif/else`);
-   Цикл `while`;
-   Бесконечный цикл;
-   Операторы `break, continue`;
-   Работа с модулем `random` для генерации случайных чисел.

```python
import random


def is_valid(num, max_range):
    return num.isdigit() and 1 <= int(num) <= max_range

print("Добро пожаловать в числовую угадайку")

try_count = 0

while(True):
    max_s = input("Введите максимальную границу: ")
    if max_s.isdigit():
        max_n = int(max_s)
        rand_n = random.randint(1, int(max_n))
        while(True):
            user_text = input(f"Введите число от 1 до {max_n}: ")
            if (is_valid(user_text, max_n)):
                user_num = int(user_text)
                try_count += 1
                if (user_num < rand_n):
                    print("Ваше число меньше загаданного, попробуйте еще разок")
                elif (user_num > rand_n):
                    print("Ваше число больше загаданного, попробуйте еще разок")
                else:
                    print("Вы угадали, поздравляем!",
                        "Количество попыток:", try_count)
                    break
                pass
            else:
                print("Некорректное число")
        another = input("Ещё игру? Y\\N ")
        if another != "Y":
            break
    else:
        print("Некорректная строка")

print("Спасибо, что играли в числовую угадайку. Еще увидимся...")
```

## [Тимур и его числа](https://stepik.org/lesson/349845/step/4?unit=333700)

Тимур загадал число от 11 до n. За какое наименьшее количество вопросов (на которые Тимур отвечает "больше" или "меньше") Руслан может гарантированно угадать число Тимура?

**Формат входных данных**  
На вход программе подается натуральное число nn.

**Формат выходных данных**  
Программа должна вывести наименьшее количество вопросов, которых гарантированно хватит Руслану, чтобы угадать число Тимура.

```python
from math import ceil, log2
print(ceil(log2(int(input()))))
```