# Тема урока: строки

## [-](https://stepik.org/lesson/302627/step/7?unit=284520)
Дополните приведенный код, используя срезы, так чтобы он вывел первые 12 символов строки `s`.

```python
s = "In 2010, someone paid 10k Bitcoin for two pizzas."
print(s[:12])
```

## [-](https://stepik.org/lesson/302627/step/8?unit=284520)
Дополните приведенный код, используя срезы, так чтобы он вывел последние 9 символов строки `s`.
```python
s = "In 2010, someone paid 10k Bitcoin for two pizzas."
print(s[-9:])
```

## [-](https://stepik.org/lesson/302627/step/9?unit=284520)
Дополните приведенный код, используя срезы, так чтобы он вывел каждый 7 символ строки `s` начиная от начала строки.
```python
s = "In 2010, someone paid 10k Bitcoin for two pizzas."
print(s[::7])
```

## [-](https://stepik.org/lesson/302627/step/10?unit=284520)
Дополните приведенный код, используя срезы, так чтобы он вывел строку `s` в обратном порядке.
```python
s = "In 2010, someone paid 10k Bitcoin for two pizzas."
print(s[::-1])
```

## [Палиндром](https://stepik.org/lesson/302627/step/11?unit=284520)

На вход программе подается одно слово, записанное в нижнем регистре. Напишите программу, которая определяет является ли оно палиндромом.

**Формат входных данных**  
На вход программе подается одно слово в нижнем регистре.

**Формат выходных данных**  
Программа должна вывести «YES», если слово является палиндромом и «NO» в противном случае.

**Примечание.** Палиндром читается одинаково в обоих направлениях, например слово «потоп».

```python
s = input()
for i in range(len(s) // 2):
    if (s[i] != s[-(i + 1)]):
        print("NO")
        break
else:
    print("YES")
```

## [Делаем срезы 1](https://stepik.org/lesson/302627/step/12?unit=284520)

На вход программе подается одна строка. Напишите программу, которая выводит:

1.  общее количество символов в строке;
2.  исходную строку повторенную 3 раза;
3.  первый символ строки;
4.  первые три символа строки;
5.  последние три символа строки;
6.  строку в обратном порядке;
7.  строку с удаленным первым и последним символом.

**Формат входных данных**  
На вход программе подается одна строка, длина которой больше 3 символов.

**Формат выходных данных**  
Программа должна вывести данные в соответствии с условием. Каждое значение выводится на отдельной строке.

```python
s = input()

print(len(s))
print(s * 3)
print(s[0])
print(s[:3])
print(s[-3:])
print(s[::-1])
print(s[1:-1])
```

## [Делаем срезы 2](https://stepik.org/lesson/302627/step/13?unit=284520)

На вход программе подается одна строка. Напишите программу, которая выводит:

1.  третий символ этой строки;
2.  предпоследний символ этой строки;
3.  первые пять символов этой строки;
4.  всю строку, кроме последних двух символов;
5.  все символы с четными индексами;
6.  все символы с нечетными индексами;
7.  все символы в обратном порядке;
8.  все символы строки через один в обратном порядке, начиная с последнего.

**Формат входных данных**  
На вход программе подается одна строка, длина которой больше 5 символов.

**Формат выходных данных**  
Программа должна вывести данные в соответствии с условием. Каждое значение выводится на отдельной строке.

```python
s = input()

print(s[2])
print(s[-2])
print(s[:5])
print(s[:-2])
print(s[::2])
print(s[1::2])
print(s[::-1])
print(s[::-2])
```

## [Две половинки](https://stepik.org/lesson/302627/step/14?unit=284520)

На вход программе подается строка текста. Напишите программу, которая разрежет ее на две равные части, переставит их местами и выведет на экран.

**Формат входных данных**  
На вход программе подается строка текста.

**Формат выходных данных**  
Программа должна вывести текст в соответствии с условием задачи.

**Примечание.** Если длина строки нечетная, то длина первой части должна быть на один символ больше.

```python
s = input()
len = len(s)

print(s[(len + 1)//2:] + s[:(len + 1)//2])
```
