# Тема урока: строки 2
## [Количество слов](https://stepik.org/lesson/303083/step/8?unit=284990)

На вход программе подается строка текста, состоящая из слов, разделенных ровно одним пробелом. Напишите программу, которая подсчитывает количество слов в ней.

**Формат входных данных**   
На вход программе подается строка текста.

**Формат выходных данных**  
Программа должна вывести количество слов.

**Примечание 1.** Строка текста не содержит пробелов в начале и конце.

**Примечание 2.** Используйте для решения задачи метод `count`.

```python
print(input().count(" ") + 1)
```

## [Минутка генетики](https://stepik.org/lesson/303083/step/9?unit=284990)

На вход программе подается строка генетического кода, состоящая из букв А (аденин), Г (гуанин), Ц (цитозин), Т (тимин). Напишите программу, которая подсчитывает сколько аденина, гуанина, цитозина и тимина входит в данную строку генетического кода.

**Формат входных данных**   
На вход программе подается строка генетического кода, состоящая из символов А, Г, Ц, Т, а, г, ц, т.

**Формат выходных данных**  
Программа должна вывести сколько гуанина, тимина, цитозина, аденина входит в данную строку генетического кода.

**Примечание.** Строка не содержит символов, кроме как А, Г, Ц, Т, а, г, ц, т.

```python
str = input().lower()

print("Аденин:", str.count("а"))
print("Гуанин:", str.count("г"))
print("Цитозин:", str.count("ц"))
print("Тимин:", str.count("т"))
```

## [Очень странные дела](https://stepik.org/lesson/303083/step/10?unit=284990)

Джим Хоппер с помощью радиоприемника пытается получить сообщение Оди. На приемник ему поступает nn различных последовательностей кода Морзе. Декодировав их, он получает последовательности из цифр и строчного латинского алфавита, при этом во всех сообщениях Оди содержится число 11, причем минимум 3 раза. Помогите определить Джиму количество сообщений от Оди.

**Формат входных данных**  
В первой строке подаётся число nn – количество сообщений, в последующих nn строках вводятся строки, содержащие латинские строчные буквы и цифры.

**Формат выходных данных**  
Программа должна вывести количество строк в которых содержится число 11 минимум 3 раза.

**Примечание:** Числа 11 необязательно должны быть разделены другими символами, нужно подсчитать вхождение последовательности символов "11", т.е. например в строке "111" содержится одна такая последовательность, в то время как в "1111" их уже две.

```python
number = int(input())
message_count = 0
for i in range(number):
    str = input()
    if (str.count("11") >= 3):
        message_count += 1
print(message_count)
```

## [Количество цифр](https://stepik.org/lesson/303083/step/11?unit=284990)

На вход программе подается строка текста. Напишите программу, которая подсчитывает количество цифр в данной строке.

**Формат входных данных**   
На вход программе подается строка текста.

**Формат выходных данных**  
Программа должна вывести количество цифр в данной строке.

```python
input = input()
counter = 0
for i in range(10):
    counter += input.count(str(i))
print(counter)
```

## [.com or .ru](https://stepik.org/lesson/303083/step/12?unit=284990)

На вход программе подается строка текста. Напишите программу, которая проверяет, что строка заканчивается подстрокой `.com` или `.ru`.

**Формат входных данных**   
На вход программе подается строка текста.

**Формат выходных данных**  
Программа должна вывести «YES» если введенная строка заканчивается подстрокой `.com` или `.ru` и «NO» в противном случае.
```python
input = input().upper()
if (input.endswith(".COM") or input.endswith(".RU")):
    print("YES")
else:
    print("NO")
```

## [Самый частотный символ](https://stepik.org/lesson/303083/step/13?unit=284990)

На вход программе подается строка текста. Напишите программу, которая выводит на экран символ, который появляется наиболее часто.

**Формат входных данных**   
На вход программе подается строка текста. Текст может содержать строчные и заглавные буквы английского и русского алфавита, а также цифры.

**Формат выходных данных**  
Программа должна вывести символ, который появляется наиболее часто.

**Примечание 1.** Если таких символов несколько, следует вывести последний по порядку символ.

**Примечание 2.** Следует различать заглавные и строчные буквы, а также буквы русского и английского алфавита.

```python
input = input()

max_syb = ""
max_count = 0
while len(input) != 0:
    syb = input[0]
    count = input.count(syb)
    if (count >= max_count):
        max_count = count
        max_syb = syb
    input = input.replace(syb, "")
print(max_syb)
```

## [Первое и последнее вхождение](https://stepik.org/lesson/303083/step/14?unit=284990)

На вход программе подается строка текста. Если в этой строке буква «f» встречается только один раз, выведите её индекс. Если она встречается два и более раз, выведите индекс её первого и последнего вхождения на одной строке, разделенных символом пробела. Если буква «f» в данной строке не встречается, следует вывести «NO».

**Формат входных данных**   
На вход программе подается строка текста.

**Формат выходных данных**  
Программа должна вывести текст в соответствии с условием задачи.

```python
input = input()
syb = "f"

if (input.count(syb) == 0):
    print("NO")
elif (input.count(syb) == 1):
    print(input.find(syb))
else:
    print(input.find(syb), input.rfind(syb))
```

## [Удаление фрагмента](https://stepik.org/lesson/303083/step/15?unit=284990)

На вход программе подается строка текста, в которой буква «h» встречается минимум два раза. Напишите программу, которая удаляет из этой строки первое и последнее вхождение буквы «h», а также все символы, находящиеся между ними.

**Формат входных данных**   
На вход программе подается строка текста.

**Формат выходных данных**  
Программа должна вывести текст в соответствии с условием задачи.

```python
input = input()
syb = "h"

start = input.find(syb)
end = input.rfind(syb)
print(input[:start] + input[end + 1:])
```
